Tekla.Structures.Drawing.ReinforcementBase.HookedEndSymbolTypes
The available hooked end symbol types.
See Tekla Structures help, "Reinforcement appearance", for more information.

Tekla.Structures.Drawing.ReinforcementBase.HookedEndSymbolTypes.NoHook
No hook symbol.

Tekla.Structures.Drawing.ReinforcementBase.HookedEndSymbolTypes.HalfHook
The half hook symbol.

Tekla.Structures.Drawing.ReinforcementBase.HookedEndSymbolTypes.FullHook
The full hook symbol.